announcements/web-news-ticker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A Web News Ticker For Emacs</title>
<!-- 2014-03-24 Mon 18:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">A Web News Ticker For Emacs</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> WebSpace: A Web News Ticker For Emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
Module Emacspeak-Webspace provides a rolling ticker of
information  that is automatically retrieved, cached and
maintained by Emacspeak.  Using this functionality, you can set
up specific buffers to have <i>interesting</i> tit-bits of information
displayed automatically in the header-line; Emacspeak speaks
these items of information as you switch contexts. This article
explains the usage model and underlying  design of Emacspeak
Webspaces.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Background</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Emacspeak Webspace module was originally created in early
<a href="http://emacspeak.blogspot.com/2008/03/emacspeak-webspace-interaction-free.html">Interaction
Free Information Access (2008)</a>
because I wanted the audio equivalent of being able to
quickly <i>glance</i> at information.  Here are some aspects of visual
interaction that I wanted to emulate:
</p>

<ul class="org-ul">
<li>You can quickly glance at something while switching contexts,
and ignore it if it is not important.
</li>
<li>The object that you <i>glance</i> at while switching contexts does
not become an object of attention ie, the casual task remains
casual, as opposed to becoming the primary task.  Email is
the antithesis to this model &#x2014; where if you start glancing
at email, it's a sufficiently strong distraction that you'll
start doing email  &#x2014; as opposed to what you were supposed
to be doing.
</li>
<li>If the item you glanced at deserves further attention, you
can come back to it later &#x2014; and the system gives you
sufficient confidence in your ability to come back to it
later &#x2014; note that this is <b>essential</b> to ensure the
previous  requirement.
</li>
<li>Items  are cached  but get pushed out by newer items &#x2014; this
makes sure you dont feel pressured to <i>read everything</i> or
have to explicitly <i>catch-up</i> &#x2014; in prior systems including
email and Google Reader, I always found the task of hitting
<i>catch-up</i> without reading everything  a fairly stressful experience.
</li>
<li>Applied to information updates, think <i>hallway conversations</i>
outside your office &#x2014; you mostly ignore them, but sometime
get drawn because you hear some specific keywords and/or
concepts that draw your attention.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Early Implementation In 2009</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I used the WebSpace functionality in Emacspeak for news and
weather updates starting 2009; at some time in late 2009, I cut
it over to get updates from my Google Reader stream.  It was
extremely effective for my usage pattern &#x2014; I typically
activated the functionality in all shell buffers. In my work
style where I switch among the primary tasks of engineering
(writing/reviewing  code), writing/reviewing design documents,
and doing email to facilitate the previous two tasks, the shell
buffer is where I switch to while context-switching e.g.,
launching a build after writing code as an example.  Having the
Webspace functionality say <i>something interesting</i> at those times
was optimal.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Initial Implementation And Design</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The information to be pulled in the rolling header line is pulled
from a cache &#x2014; in 2009, this cache was populated from my Google
Reader stream. The cache was maintained in a ring with older
items falling off the end.  You could optionally switch to a
buffer displaying all of the currently cached items &#x2014; this
functionality assured me that  I could always later find an item
that  had caught my attention while  I was in the process of
context switching amongst tasks. Notice that if I didn't go back
and check for that item within a day, it would fall off the
ring-buffer cache &#x2014; and this usually would mean that it likely
wasn't that important after all.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Life After Google Reader</h3>
<div class="outline-text-3" id="text-1-4">
<p>
With the passing of Google Reader last year, I started
implementing the feed-reading functionality I needed in Emacspeak
independent of Google Reader; see the earlier article in this
blog titled <a href="http://emacspeak.blogspot.com/2013/12/managing-and-accessing-feeds-on.html">Managing And Accessing Feeds On The Emacspeak Audio
Desktop</a>.
Next, I updated the Emacspeak WebSpace functionality to build its
cache from the set of feeds in <span class="underline">emacspeak<sub>feeds</sub></span>.
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Usage Pattern</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This section details my own usage pattern and set-up &#x2014; this is
by no means the only way to use this functionality.
</p>

<ol class="org-ol">
<li>Emacspeak binds Webspace functionality to  <span class="underline">Hyper Space</span>  as
a prefix key.
</li>
<li><span class="underline">Hyper Space h</span> invokes command
<span class="underline">emacspeak-webspace-headlines</span>  &#x2014; this command
initializes the feed-store cache, and sets up the
header-line in the current buffer to display a rolling
ticker.  Note that you can invoke this command in multiple
buffers;  those buffers will share a common headlines cache.
</li>
<li>The feed-store is updated during Emacs idle-time; I often
invoke  the elisp form
<span class="underline">(emacspeak-webspace-headlines-populate)</span> to populate the
cache initially. Note that depending on your network, and
the number of feeds you have in <span class="underline">emacspeak-feeds</span>, this can
block emacs for a couple of minutes.
</li>
<li>Command <span class="underline">emacspeak-webspace-headlines-browse</span>  displays an
interactive buffer containing the current set  of cached
headlines &#x2014; this is where you go to track down a headline
you heard in passing. I bind this to <span class="underline">Super h</span> by
customizing <span class="underline">emacspeak-super-keys</span>.
</li>
<li>You can set up other types of information in your rolling
header &#x2014; something I initially used it for was weather
&#x2014; see command  <span class="underline">emacspeak-webspace-weather</span>   personally,
I 've not found this as useful in CA given how consistently
good the weather is here.
</li>
<li>For related work in Emacs, see Emacs package <span class="underline">newsticker</span>.
That package works well with Emacspeak, but in using it
earlier, I found that I could not prevent myself from
starting to read content i.e., it failed to meet the
<i>glance and continue</i> requirement.
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-03-24 Mon&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2014-03-24 Mon 18:00</p>
<p class="creator">Emacs 24.3.50.2 (Org mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
